<script>
	import RetroCard from "$lib/components/RetroCard.svelte";

</script>
<h1>隐私权条款</h1>
<br />
<hr />
<br />
<p>
	网维在向您提供服务时，需要和您的个人信息打交道。我们非常注重用户的数字个人隐私，对于有关问题，我们做出以下承诺：
</p>
<br/>
<h2>我们需要您的什么信息？</h2>
<p>为了派遣成员上门为您维修网络问题，在您注册报修系统时，我们需要获取您的：</p>
<br/>
<ul>
	<li>宿舍住址</li>
	<li>联系电话</li>
	<li>校园卡账号</li>
</ul>
<br/>
<p>此外，为了确认您身份的真实性，我们还需要您的学号和真实姓名。</p>
<p>
	在初次注册时，您的微信账户与您提交的学号和真实姓名绑定，原则上无法改动，而其余个人信息皆可以随时修改。
</p>
<br/>
<h2>我们如何保管您的信息？</h2>
<p>
	我们使用妥善的措施，将您的个人信息保护在多项安全机制之内。除非根据下文所描述的信息使用条款合规将您的信息提供给有关人员之外，您提交给我们的个人信息绝不会被任何个人与集体知晓。
</p>
<br/>
<p>
	当您修改您的个人信息，提交成功后，您的旧信息将在现有数据库中被永久删除。但是我们会定期备份我们的数据库，其中可能包含了旧的个人信息。不过，这些备份会被加密妥善保存，除非报修系统数据库遇到了损坏的情况，需要恢复备份的，否则任何人都无权访问这些数据。
</p>
<br/>
<h2>我们如何使用您的信息？</h2>
<p>
	为了为您进行上门维修服务，当您在报修系统中有未解决的工单时，您的姓名，联系电话，宿舍住址和校园网账号将会在报修系统后台中被展示给有关的网维成员，以便它们进行上门维修或联系您进行其它相关事宜。当工单完成或被取消时，您的个人信息也将对普通网维成员不可见，但是您的信息会随着工单处理记录在管理层后台中保留一段时间，以供网维的管理层来进行审计工作。
</p>
<br/>
<p>
	当遇到网维无法解决的问题，我们将启动上报程序，将您的网络问题告知运营商方面的有关工程师。此时，您的姓名，住址，学号等个人信息将会通过网维和运营商的对接机制，妥善地随着工单一并发送给您校园卡所在的运营商。
</p>
<br/>
<p>
	除此之外，<strong
		>我们不会将您的个人信息以任何方式泄露给任何个人或集体，尤其不会将您的信息用于商业营销或广告方面</strong
	>。
</p>
<br/>
<p>
	如果您发现有网维成员或者运营商方面有关人员使用您提供给网维的个人信息，进行除了网络维修及其有关事宜之外的活动的，您可以通过多种方式进行投诉：
</p>
<br/>
<ul>
	<li>在我们的报修系统后台聊天栏进行留言</li>
	<li>加入我们的网络支持QQ群，私聊群管理反馈问题。</li>
</ul>
<br/>
<br />
<hr />
<br />
<p>本条款最后更新于2025年12月27日，最终解释权归网维所有。</p>

