<h1>关于网维</h1>
<br />
<hr />
<br />
<p>
	中山学院网络维护科是一个独立的<strong>学生组织</strong
	>，成立于2005年，接受校信息中心的指导和管理。
</p>
<p>
	网维的主要任务是保证校园宿舍网络的正常运行，处理解决在校学生所报修的有线校园网问题，这项业务主要通过依托于微信的网络报修系统来运行。
</p>
<p>
	在网维工作没有工资，促使我们成立这个组织的原因是对网络技术的热爱和对校园网正常运行的责任感，我们的宗旨是全心全意为同学服务。我们对外认真负责，在内和谐友善。
	目前，我们与三大运营商建立了良好的合作关系，承接运营商在校园内的装维业务；在信息中心的关怀下，我们也承担学校部分IT后勤工作。
</p>
<p>
	对于学生校园网报修，我们的成员会在<strong>每天16:30~18:00</strong
	>统一上门解决问题，用户在这个时间段必须本人在宿舍。
</p>
<p>
	网维一般会在每年的9~10月招新，对象为当年新生，要求有基础的计算机知识。具体招新事宜，请以实际通告为准。
</p>
<br />
<hr />
<br />
<a href="/about/TOS">报修系统的服务条款</a> |
<a href="/about/privacy">报修系统会如何处理您的个人信息？</a>
